wavetest/T1/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
	(26 0 0)
	(26 0.7 0)
	(0 0.7 0)
	(0 0 1.5)
	(26 0 1.5)
	(26 0.7 1.5)
	(0 0.7 1.5)
);


blocks
(
	hex (0 1 2 3 4 5 6 7) (2600 70 150) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oversetPatch
    {
        type overset;
        faces ();
    }

    inlet
    {
        type patch;
        faces
        (
			(0 4 7 3)
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0 3 2 1)
        );
    }
	
	
    frontandback
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
